# 1. Имеется поле 3x3 необходимо реализовать возможность отрисовки на нём квадрата. Если квадрат занимает всё поле,
# то центр необходимо оставить пустым


# Пример вывода
#   [[*],[*],[*]],
#   [[*],[ ],[*]],
#   [[*],[*],[*]],

field = [
    [[],[],[]],
    [[],[],[]],
    [[],[],[]],
]

# 2. Написать свой декоратор для любой функции в client

# 3. Необходимо написать функцию, которая разбивает предложения на слова и возвращает список слов.
# Далее необходимо написать под неё декоратор, который форматирует список слов в верхний регистр и возвращает их