# 1. Создайте класс Vehicle с базовыми-абстрактными функциями любого транспортного средства (Движение вперед, движение назад, запуск двигателя).
# Создайте 2 наследников класса Vehicle, опишитие их базовый функционал и аргументы.
# Создайте по объекту для каждого из класса-наследника. Воспользуйтесь функциями наследуемого класса и родительского

# 2. На основе моего кода допишите необходимые методы и атрибуты классов, чтобы пользователь мог взаимодействовать
# с TaskManager'ом через клиент.
#
# TO DO:
#  - Метод добавления ачивки за решение 5 задач
#  - Ачивку и её добавление за какую-либо активность
#  - Рефакторинг метода task_manager/model.py/TaskManager._get_tasks
#  - Найти баг в приложении и исправить его
#
# Возможно вы придумаете как оптимизировать какой-то из методов и это будет очень круто
# (Если в процессе выполнения будут вопросы, пишите, не стесняйтесь)
# Запушьте этот код в отдельный репозиторий, либо зарефакторите свой, вынесев решения практических задач в отдельную
# директорию. Удачи)